from DBManager import DBManager

db_manager = DBManager("MY_PROJECT.db")
db_manager.create_tables()

#db_manager.add_compositions(1, "втеча з шоушенка.jpg", "Втеча з Шоушенка (1994)", "Драма", "Фільм" )
#db_manager.add_topics(41, 1, "втеча з шоушенка.jpg", 1994, "США", "16+", "Драма, Кримінал", "Тім Робінс, Морган Фрімен, Боб Ґантон, Вільям Седлер, Кленсі Браун, Джил Белловс", "Френк Дарабонт", "Енді Дюфрейн, молодий і талановитий банкір, несправедливо засуджений до довічного ув'язнення за подвійне вбивство своєї дружини і її коханця. Він потрапляє до жорстокої в'язниці Шоушенк, де повсякденне життя наповнене насильством, корупцією та безнадією. Попри важкі умови, Енді зберігає оптимізм і силу духу.В'язниця стає місцем, де Енді зустрічає Реда, довічного ув'язненого, відомого своєю здатністю діставати будь-які речі. Між ними зав'язується міцна дружба, що стає ключовою для історії. Енді поступово пристосовується до життя в Шоушенку, стаючи бухгалтером для начальника в'язниці і допомагаючи з корупційними фінансовими схемами.Водночас Енді не полишає мрії про свободу. Упродовж багатьох років він таємно планує втечу, викопуючи тунель за допомогою молотка для каменю, приховуючи свою роботу за плакатами актрис, таких як Ріта Гейворт. Зрештою, Енді реалізує свій план: йому вдається втекти через тунель, що веде до каналізації, і втекти до свободи.Перед втечею Енді також організовує, щоб корупційні дії начальника в'язниці були викриті, що призводить до його арешту. Енді тікає до Мексики, де починає нове життя.Розповідь завершується тим, що Ред, звільнений після багатьох років у Шоушенку, вирушає на зустріч із Енді. Їхня дружба і віра в краще майбутнє стають символом надії і перемоги людського духу над обставинами." )


#db_manager.add_compositions(2, "хрещенний батько.jpg", "Хрещений батько (1972)", "Кримінал", "Фільм" )
#db_manager.add_topics(42, 2, "хрещенний батько.jpg", 1972, "США", "16+", "Драма, Кримінал", "Марлон Брандо, Аль Пачіно, Джеймс Каан, Річард Кастелліано, Роберт Дювалл, Стерлінґ Гайден", "Френсіс Форд Коппола", "'Хрещений батько' – це епічна сага про італо-американську мафіозну сім'ю Корлеоне в Нью-Йорку після Другої світової війни. Головний герой, дон Віто Корлеоне, є шанованим лідером сім'ї, але його мирне життя порушується, коли на нього здійснюється замах.Його молодший син, Майкл, який спочатку не бажав брати участь у сімейному бізнесі, поступово втягується у кримінальний світ, щоб захистити свою сім'ю. Фільм досліджує тему лояльності, влади, моральних дилем та ціну, яку доводиться платити за успіх у кримінальному світі." )

#db_manager.add_compositions(3, "темний лицар.jpg", "Темний лицар (2008)", "Екшн, Кримінал", "Фільм" )
#db_manager.add_topics(43, 3, "темний лицар.jpg", 2008, "США, Велика Британія", "12+", "Екшн , Драми , Кримінал , Трилери", "Крістіан Бейл, Хіт Леджер, Аарон Екхарт, Майкл Кейн, Меґґі Джилленгол, Ґері Олдман", "Крістофер Нолан", "У Готем-Сіті з'являється новий, ще більш небезпечний ворог – харизматичний і божевільний Джокер, який прагне занурити місто в хаос і довести, що навіть Бетмен не здатний врятувати його. Тим часом, Бетмен намагається зберегти крихку рівновагу між кримінальним світом і правосуддям, але дії Джокера загрожують зруйнувати все, що він побудував. У цій боротьбі Бетмен стикається з найважчими моральними виборами, які можуть змінити його назавжди.")


#db_manager.add_compositions(4, "хрещений батько 2.jpg", "Хрещений батько 2 (1974)", "Кримінал, драма", "Фільм" )
#db_manager.add_topics(44, 4, "хрещений батько 2.jpg", 1974, "США", "16+", "Драма, Кримінал", "Аль Пачіно, Роберт Дювалл, Даян Кітон, Роберт де Ніро, Джон Казал, Талія Шайр", "Френсіс Форд Коппола", "'Хрещений батько 2' – це епічна сага, яка продовжує історію відомої мафіозної сім'ї Корлеоне. На відміну від першої частини, де фокус був на Майклі Корлеоне, тут сюжет розгалужується на дві паралельні лінії:Молодість Віто Корлеоне: Фільм переносить нас у минуле, показуючи, як молодий Віто Корлеоне, після вбивства сім'ї на Сицилії, емігрує до Америки. Ми бачимо його становлення як успішного бізнесмена і, згодом, дона. Ця лінія допомагає глибше зрозуміти мотиви і цінності Віто, а також простежити, як він побудував свою імперію. Майкл Корлеоне в сьогоденні: Паралельно розвивається сюжет про Майкла, який тепер очолює сімейний бізнес. Він стикається з новими викликами, серед яких – розширення впливу сім'ї на захід, боротьба з політичними силами та конкуренція з іншими мафіозними кланами.")


#db_manager.add_compositions(5, "12 розгніваних чоловіків.jpg", "12 розгніваних чоловіків (1957)", "Трилер, кримінал", "Фільм" )
#db_manager.add_topics(45, 5, "12 розгніваних чоловіків.jpg", 1957, "США", "16+", "Драма , Кримінал", "Мартін Балсам, Джон Фідлер, Лі Кобб, Джек Клаґмен, Едвард Біннс", "Сідні Люмет", "'12 Розгніваних Чоловіків' – це класична кінодрама, яка тримає глядача в напрузі від початку до кінця. Фільм розповідає історію дванадцяти присяжних, яким доручено вирішити долю молодого чоловіка, обвинуваченого у вбивстві власного батька.Сюжет розгортається в одній кімнаті, де присяжні змушені усамітнитися, щоб обговорити вердикт. На початку здається, що все просто: більшість присяжних схиляється до обвинувального вироку, адже всі докази вказують на винуватість підсудного. Однак, один присяжний висловлює сумнів. Саме він ініціює бурхливу дискусію, під час якої кожен з присяжних починає ставити під сумнів наявні докази та власні переконання.")


#db_manager.add_compositions(6, "Володар перснів.jpg", "Володар перснів: Повернення короля (2003)", "Фантастика, пригоди", "Фільм" )
#db_manager.add_topics(46, 6, "Володар перснів.jpg", 2003, "США, Нова Зеландія", "12+", "Екшн , Пригоди , Драма , Фентезі", "Ноел Епплбі, Олександра Естін, Шон Астін, Девід Астон, Джон Беч, Вігго Мортенсен, Елайджа Вуд, Ієн Маккеллен", "Пітер Джексон", "'Володар Перснів: Повернення Короля' – це фінальна частина трилогії, яка підводить риску під довгою і виснажливою боротьбою добра зі злом. Після подій 'Двох веж', Братство Персня розпалося, і кожен з його членів має свою власну місію. Фродо і Сем: Хоббіти продовжують свою небезпечну подорож до Мордору, щоб знищити Єдине Кільце у Вогняній Горі. Їм доводиться зіткнутися з численними труднощами, включаючи зустріч з Голлумом, який прагне повернути собі Кільце. Арагорн: Король Елесар об'єднує армії Заходу для останньої битви проти військ Саурона. Йому належить не тільки вести армію, але й здобути серце Арвен, ельфійки, яка готова відмовитися від безсмертя заради кохання. Гендальф: Сірий Чарівник повертається як Білий і бере на себе важливу роль у об'єднанні сил добра. Він допомагає Арагорну готуватися до битви і шукає способи відволікти увагу Саурона від Мордору. Мери і Піппін: Хоббіти потрапляють у полон до орків і беруть участь у битві при Хельмовій Паді. Пізніше вони грають важливу роль у битві при Пеленнорі.")


#db_manager.add_compositions(7, "Список Шиндлера.jpg", "Список Шиндлера (1993)", "Воєнний, драма", "Фільм" )
#db_manager.add_topics(47, 7, "Список Шиндлера.jpg", 1993, "США", "16+", "Фільм, Драма, Історичний, Біографічний", "Ліам Нісон, Бен Кінґслі, Ральф Файнс, Керолайн Ґудолл, Йонатан Сегаль, Ембет Девідц", "Стівен Спілберґ", "'Список Шиндлера' – це зворушлива кінодрама, заснована на реальних подіях, яка розповідає історію німецького бізнесмена Оскара Шиндлера, який врятував понад тисячу євреїв під час Голокосту. Дія розгортається в Кракові під час Другої світової війни. Оскар Шиндлер, член нацистської партії, приїздить до міста з метою сколотити капітал на війні. Спочатку він бачить у євреях лише дешеву робочу силу. Однак, зіткнувшись з жахами Голокосту, Шиндлер поступово змінюється. Він починає розуміти, що людське життя набагато цінніше за будь-які гроші. Шиндлер використовує свій вплив і зв'язки, щоб захистити євреїв, які працюють на його фабриці. Він підробляє документи, платить хабарі нацистським офіцерам і ризикує власним життям, щоб врятувати їх від депортації в концентраційні табори.")


#db_manager.add_compositions(8, "Кримінальне чтиво.jpg", "Кримінальне чтиво (1994)", "Кримінал, трилер", "Фільм" )
#db_manager.add_compositions(9, "Володар перснів_ Хранителі персня.jpg", "Володар перснів: Хранителі персня (2001)", "Фантастика, пригоди", "Фільм" )
#db_manager.add_compositions(10, "Хороший, поганий, злий.jpg", "Хороший, поганий, злий (1966)", "Вестерн, екшн", "Фільм" )

#Серіали

#db_manager.add_compositions(11, "пуститися берега.jpg", "Пуститися берега (2008)", "Драма, Трилер", "Серіал")
#db_manager.add_compositions(12, "гра престолів.jpg", "Гра Престолів (2011)", "Драма, Пригоди, Фантастика", "Серіал" )
#db_manager.add_compositions(13, "Мандалорець.jpg", "Мандалорець / Мандалоріанець (2019)", "Пригоди, Фантастика", "Серіал" )
#db_manager.add_compositions(14, "друзі.jpg", "Друзі (1994)", "Драма, Комеді", "Серіал")
#db_manager.add_compositions(15, "Клан Сопрано.jpg", "Клан Сопрано (1999)", "Драма, Кримінал", "Серіал")
#db_manager.add_compositions(16, "Сайнфелд.jpg", "Сайнфелд (1989)", "Комеді", "Серіал")
#db_manager.add_compositions(17, "Картковий будинок.jpg", "Картковий будинок (2013)", "Драма", "Серіал")
#db_manager.add_compositions(18, "загубленні.jpg", "Загублені (2004)", "Детектив, Драма, Пригоди, Трилер, Фантастика", "Серіал")
#db_manager.add_compositions(19, "Світ Дикого Заходу.jpg", "Світ Дикого Заходу (2016)", "Детектив, Драма, Пригоди, Фантастика", "Серіал")
#db_manager.add_compositions(20, "Дивні Дива.jpg", "Дивні Дива (2016)", "Детектив, Драма, Жахи, Трилер, Фантастика", "Серіал")

#Мультфільми

#db_manager.add_compositions(21, "віднесені привидами.jpg", "Віднесені привидами (2001)", "Фантастика, Пригоди", "Мультфільм")
#db_manager.add_compositions(22, "Kimetsu no Yaiba Tsuzumi Yashiki-hen.jpg", "Kimetsu no Yaiba: Tsuzumi Yashiki-hen (2021)", "Аніме, Бойовик, Фентезі", "Мультфільм")
#db_manager.add_compositions(23, "король лев.jpg", "Король Лев (1994)", "Дитячий, Мюзикл", "Мультфільм")
#db_manager.add_compositions(24, "людина павук крізь всесвіт.jpg", "Людина-павук: Крізь Всесвіт (2023)", "Екшн, Наукова фантастика", "Мультфільм")
#db_manager.add_compositions(25, "могила світлячків.jpg", "Могила світлячків (1988)", "Воєнний, Драма", "Мультфільм")
#db_manager.add_compositions(26, "Людина павук Навколо світу.jpg", "Людина павук: Навколо світу (2018)", "Пригоди, Екшн", "Мультфільм")
#db_manager.add_compositions(27, "Твоє ім’я.jpg", "Твоє ім’я (2016)", "Фантастика, Романтика", "Мультфільм")
#db_manager.add_compositions(28, "коко.jpg", "Коко (2017)", "Дитячий, Фантастика", "Мультфільм")
#db_manager.add_compositions(29, "ВОЛЛ-І.jpg", "ВОЛЛ-І (2008)", "Дитячий, Наукова фантастика", "Мультфільм")
#db_manager.add_compositions(30, "історія іграшок.jpg", "Історія іграшок (1995)", " Дитячий, Комедія", "Мультфільм")

#Мультсеріали






