from DBManager import DBManager

db_manager = DBManager("MY_PROJECT.db")
db_manager.create_tables()

#db_manager.add_compositions(1, "втеча з шоушенка.jpg", "Втеча з Шоушенка (1994)", "Драма", "Фільм" )
#db_manager.add_topics(41, 1, "втеча з шоушенка.jpg", 1994, "США", "16+", "Драма, Кримінал", "Тім Робінс, Морган Фрімен, Боб Ґантон, Вільям Седлер, Кленсі Браун, Джил Белловс", "Френк Дарабонт", "Енді Дюфрейн, молодий і талановитий банкір, несправедливо засуджений до довічного ув'язнення за подвійне вбивство своєї дружини і її коханця. Він потрапляє до жорстокої в'язниці Шоушенк, де повсякденне життя наповнене насильством, корупцією та безнадією. Попри важкі умови, Енді зберігає оптимізм і силу духу.В'язниця стає місцем, де Енді зустрічає Реда, довічного ув'язненого, відомого своєю здатністю діставати будь-які речі. Між ними зав'язується міцна дружба, що стає ключовою для історії. Енді поступово пристосовується до життя в Шоушенку, стаючи бухгалтером для начальника в'язниці і допомагаючи з корупційними фінансовими схемами.Водночас Енді не полишає мрії про свободу. Упродовж багатьох років він таємно планує втечу, викопуючи тунель за допомогою молотка для каменю, приховуючи свою роботу за плакатами актрис, таких як Ріта Гейворт. Зрештою, Енді реалізує свій план: йому вдається втекти через тунель, що веде до каналізації, і втекти до свободи.Перед втечею Енді також організовує, щоб корупційні дії начальника в'язниці були викриті, що призводить до його арешту. Енді тікає до Мексики, де починає нове життя.Розповідь завершується тим, що Ред, звільнений після багатьох років у Шоушенку, вирушає на зустріч із Енді. Їхня дружба і віра в краще майбутнє стають символом надії і перемоги людського духу над обставинами." )


#db_manager.add_compositions(2, "хрещенний батько.jpg", "Хрещений батько (1972)", "Кримінал", "Фільм" )
db_manager.add_topics(42, 2, "хрещенний батько.jpg", 1972, "США", "16+", "Драма, Кримінал", "Марлон Брандо, Аль Пачіно, Джеймс Каан, Річард Кастелліано, Роберт Дювалл, Стерлінґ Гайден", "Френсіс Форд Коппола", ".." )

#db_manager.add_compositions(3, "темний лицар.jpg", "Темний лицар (2008)", "Екшн, Кримінал", "Фільм" )
db_manager.add_topics(43, 3, "темний лицар.jpg", 2008, "США, Велика Британія", "12+", "Екшн , Драми , Кримінал , Трилери", "Крістіан Бейл, Хіт Леджер, Аарон Екхарт, Майкл Кейн, Меґґі Джилленгол, Ґері Олдман", "Крістофер Нолан", ".")


#db_manager.add_compositions(4, "хрещений батько 2.jpg", "Хрещений батько 2 (1974)", "Кримінал, драма", "Фільм" )
db_manager.add_topics(44, 4, "хрещений батько 2.jpg", 1974, "США", "16+", "Драма, Кримінал", "Аль Пачіно, Роберт Дювалл, Даян Кітон, Роберт де Ніро, Джон Казал, Талія Шайр", "Френсіс Форд Коппола", "...")


#db_manager.add_compositions(5, "12 розгніваних чоловіків.jpg", "12 розгніваних чоловіків (1957)", "Трилер, кримінал", "Фільм" )
db_manager.add_topics(45, 5, "12 розгніваних чоловіків.jpg", 1957, "США", "16+", "Драма , Кримінал", "Мартін Балсам, Джон Фідлер, Лі Кобб, Джек Клаґмен, Едвард Біннс", "Сідні Люмет", "..")


#db_manager.add_compositions(6, "Володар перснів.jpg", "Володар перснів: Повернення короля (2003)", "Фантастика, пригоди", "Фільм" )
db_manager.add_topics(46, 6, "Володар перснів.jpg", 2003, "США, Нова Зеландія", "12+", "Екшн , Пригоди , Драма , Фентезі", "Ноел Епплбі, Олександра Естін, Шон Астін, Девід Астон, Джон Беч, Вігго Мортенсен, Елайджа Вуд, Ієн Маккеллен", "Пітер Джексон", "..")


#db_manager.add_compositions(7, "Список Шиндлера.jpg", "Список Шиндлера (1993)", "Воєнний, драма", "Фільм" )
db_manager.add_topics(47, 7, "Список Шиндлера.jpg", 1993, "США", )


#db_manager.add_compositions(8, "Кримінальне чтиво.jpg", "Кримінальне чтиво (1994)", "Кримінал, трилер", "Фільм" )
#db_manager.add_compositions(9, "Володар перснів_ Хранителі персня.jpg", "Володар перснів: Хранителі персня (2001)", "Фантастика, пригоди", "Фільм" )
#db_manager.add_compositions(10, "Хороший, поганий, злий.jpg", "Хороший, поганий, злий (1966)", "Вестерн, екшн", "Фільм" )
#db_manager.add_compositions(11, "пуститися берега.jpg", "Пуститися берега (2008)", "Драма, Трилер", "Серіал")
#db_manager.add_compositions(12, "гра престолів.jpg", "Гра Престолів (2011)", "Драма, Пригоди, Фантастика", "Серіал" )
#db_manager.add_compositions(13, "Мандалорець.jpg", "Мандалорець / Мандалоріанець (2019)", "Пригоди, Фантастика", "Серіал" )
#db_manager.add_compositions(14, "друзі.jpg", "Друзі (1994)", "Драма, Комеді", "Серіал")
#db_manager.add_compositions(15, "Клан Сопрано.jpg", "Клан Сопрано (1999)", "Драма, Кримінал", "Серіал")
#db_manager.add_compositions(16, "Сайнфелд.jpg", "Сайнфелд (1989)", "Комеді", "Серіал")
#db_manager.add_compositions(17, "Картковий будинок.jpg", "Картковий будинок (2013)", "Драма", "Серіал")
#db_manager.add_compositions(18, "загубленні.jpg", "Загублені (2004)", "Детектив, Драма, Пригоди, Трилер, Фантастика", "Серіал")
#db_manager.add_compositions(19, "Світ Дикого Заходу.jpg", "Світ Дикого Заходу (2016)", "Детектив, Драма, Пригоди, Фантастика", "Серіал")
#db_manager.add_compositions(20, "Дивні Дива.jpg", "Дивні Дива (2016)", "Детектив, Драма, Жахи, Трилер, Фантастика", "Серіал")




