from DBManager import DBManager

db_manager = DBManager("MY_PROJECT.db")
db_manager.create_tables()

#db_manager.add_compositions(1, "втеча з шоушенка.jpg", "Втеча з Шоушенка (1994)", "Драма", "Фільм" )
#db_manager.add_topic(41, 1, "втеча з шоушенка.jpg", 1994, "США", "16+", "Драма, Кримінал", "Тім Робінс, Морган Фрімен, Боб Ґантон, Вільям Седлер, Кленсі Браун, Джил Белловс", "Френк Дарабонт", "Енді Дюфрейн, молодий і талановитий банкір, несправедливо засуджений до довічного ув'язнення за подвійне вбивство своєї дружини і її коханця. Він потрапляє до жорстокої в'язниці Шоушенк, де повсякденне життя наповнене насильством, корупцією та безнадією. Попри важкі умови, Енді зберігає оптимізм і силу духу.В'язниця стає місцем, де Енді зустрічає Реда, довічного ув'язненого, відомого своєю здатністю діставати будь-які речі. Між ними зав'язується міцна дружба, що стає ключовою для історії. Енді поступово пристосовується до життя в Шоушенку, стаючи бухгалтером для начальника в'язниці і допомагаючи з корупційними фінансовими схемами.Водночас Енді не полишає мрії про свободу. Упродовж багатьох років він таємно планує втечу, викопуючи тунель за допомогою молотка для каменю, приховуючи свою роботу за плакатами актрис, таких як Ріта Гейворт. Зрештою, Енді реалізує свій план: йому вдається втекти через тунель, що веде до каналізації, і втекти до свободи.Перед втечею Енді також організовує, щоб корупційні дії начальника в'язниці були викриті, що призводить до його арешту. Енді тікає до Мексики, де починає нове життя.Розповідь завершується тим, що Ред, звільнений після багатьох років у Шоушенку, вирушає на зустріч із Енді. Їхня дружба і віра в краще майбутнє стають символом надії і перемоги людського духу над обставинами." )
#db_manager.add_actors(1,"тім роббінс.jpg", "Тім Робінс", "Тімоті Френсіс Роббінс", "16.10.1958", "Вест-Ковіна, Каліфорнія, США", "«Даргемський бик» (1988), «Драбина Іакова» (1990), «Гравець» (1992), «Підручний Гадсакера» (1994), «Втеча з Шоушенка» (1994) і «Таємнича ріка» (2003)")
#db_manager.add_actor_to_film(1, 1)
#db_manager.add_actors(2, "морган фрімен.jpg", "Морган Фрімен", "Морган Фрімен", "01.06.1937", "Мемфіс, Теннессі, США", "«Втеча з Шоушенка» (1994), «Темний Лицар» (2008), «Сім» (1995), «Темний лицар повертається» (2012), «Непрощений» (1992), «Бетмен: Початок» (2005)")
#db_manager.add_actor_to_film(1, 2)
#db_manager.add_actors(3, "боб г.jpg", "Боб Ґантон", "Роберт Патрік Ґантон молодший (англ. Robert Patrick Gunton Jr)", "15.11.1945", "Санта-Моніка, окр. Л.-Анджелес, Каліфорнія, США", "«Втеча з Шоушенка» (1994), «Джон Ф. Кеннеді. Постріли в Далласі» (1991), «Друга Світова війна: За зачиненими дверима. Сталін, нацисти та Захід» (2008), «Слава» (1989), «Арго» (2012)")
#db_manager.add_actor_to_film(1, 3)
#db_manager.add_actors(4, "вільям седлер.jpg", "Вільям Седлер", "Вільям Томас Седлер (англ. William Thomas Sadler)", "13.04.1950", "Баффало, Нью-Йорк, США", "«Втеча з Шоушенка» (1994), «Зелена миля» (1999), «Тихий океан» (2010)")
#db_manager.add_actor_to_film(1, 4)
#db_manager.add_actors(5, "к. браун.jpg", "Кленсі Браун", "Кларенс Джей Браун III (англ. Clarence John Brown III)", "05.01.1959", "Урбана, Огайо, США", "«Втеча з Шоушенка» (1994), «Пінгвін» (2024), «Губка Боб квадратні штани» (1999), «Декстер: Нова кров» (2021), «Брати Вентура: Сяйво - це кров серця бабуїна» (2023), «Тор: Раґнарок» (2017)" )
#db_manager.add_actor_to_film(1, 5)
#db_manager.add_actors(6, "Гіл Беллоуз.jpg", "Гіл Беллоуз", "Гіл Беллоуз (англ. Gil Bellows)", "28.06.1967", "Ванкувер, Британська Колумбія, Канада", "«Втеча з Шоушенка» (1994), «Джетт» (2019), «Немислиме / Незбагненне» (2020)")
#db_manager.add_actor_to_film(1, 6)


#db_manager.add_compositions(2, "хрещенний батько.jpg", "Хрещений батько (1972)", "Кримінал", "Фільм" )
#db_manager.add_topic(42, 2, "хрещенний батько.jpg", 1972, "США", "16+", "Драма, Кримінал", "Марлон Брандо, Аль Пачіно, Джеймс Каан, Річард Кастелліано, Роберт Дювалл, Стерлінґ Гайден", "Френсіс Форд Коппола", "'Хрещений батько' – це епічна сага про італо-американську мафіозну сім'ю Корлеоне в Нью-Йорку після Другої світової війни. Головний герой, дон Віто Корлеоне, є шанованим лідером сім'ї, але його мирне життя порушується, коли на нього здійснюється замах.Його молодший син, Майкл, який спочатку не бажав брати участь у сімейному бізнесі, поступово втягується у кримінальний світ, щоб захистити свою сім'ю. Фільм досліджує тему лояльності, влади, моральних дилем та ціну, яку доводиться платити за успіх у кримінальному світі." )
#db_manager.add_actors(7, "марлон.jpg", "Марлон Брандо", "Марлон Брандо-молодший (англ. Marlon Brando, Jr.)", "03.04.1924, смерть: 01.07.2004", "Омаха, Небраска, США", "«Хрещений батько» (1972), «Апокаліпсис наших днів» (1979), «У порту» (1954), «Трамвай «Бажання»» (1951)")
#db_manager.add_actor_to_film(2, 7)
#db_manager.add_actors(8, "аль пачічо.jpg", "Аль Пачино", "Альфредо Джеймс Пачіно (англ. Alfredo James Al Pacino)", "25.04.1940", "Нью-Йорк, Нью-Йорк, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Сутичка / Схватка / Двобій» (1995), «Обличчя зі шрамом» (1983), «Янголи в Америці» (2003), «Собачий полудень» (1975), «Запах жінки» (1992)")
#db_manager.add_actor_to_film(2, 8)
#db_manager.add_actors(9, "каан.jpg", "Джеймс Каан", "Джеймс Едмунд Каан (англ. James Edmund Caan)", "26.03.1940, смерть: 06.07.2022", "Бронкс, Нью-Йорк, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Доґвіль» (2003), «Мізері» (1990)")
#db_manager.add_actor_to_film(2, 9)
#db_manager.add_actors(10, "кастеллано.jpg", "Річард Кастеллано", "Річард Сальваторе Кастеллано (англ. Richard Salvatore Castellano)", "04.09.1933, смерть: 10.12.1988", "Бронкс, Нью-Йорк, США", "«Хрещений батько» (1972)")
#db_manager.add_actor_to_film(2, 10)
#db_manager.add_actors(11, "дюваль.jpg", "Роберт Дюваль", "Роберт Селден Дюваль (англ. Robert  Selden Duvall)", "05.01.1931", "Сан-Дієго, Каліфорнія, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Апокаліпсис наших днів» (1979), «Вбити пересмішника» (1964), «Телемережа» (1976)")
#db_manager.add_actor_to_film(2, 11)
#db_manager.add_actors(12, "гайден.jpg", "Стерлінг Гейден", "Стерлінг Волтер Гейден (англ. Sterling Walter Hayden)", "26.03.1916, смерть: 23.05.1986", "Верхній Монклер, Нью-Джерсі, США", "«Хрещений батько» (1972), «Доктор Стрейнджлав, або Як я перестав хвилюватись і полюбив бомбу» (1964), «Вбивство» (1956), «Асфальтові джунглі» (1950)")
#db_manager.add_actor_to_film(2, 12)


#db_manager.add_compositions(3, "темний лицар.jpg", "Темний лицар (2008)", "Екшн, Кримінал", "Фільм" )
#db_manager.add_topic(43, 3, "темний лицар.jpg", 2008, "США, Велика Британія", "12+", "Екшн , Драми , Кримінал , Трилери", "Крістіан Бейл, Хіт Леджер, Аарон Екхарт, Майкл Кейн, Меґґі Джилленгол, Ґері Олдман", "Крістофер Нолан", "У Готем-Сіті з'являється новий, ще більш небезпечний ворог – харизматичний і божевільний Джокер, який прагне занурити місто в хаос і довести, що навіть Бетмен не здатний врятувати його. Тим часом, Бетмен намагається зберегти крихку рівновагу між кримінальним світом і правосуддям, але дії Джокера загрожують зруйнувати все, що він побудував. У цій боротьбі Бетмен стикається з найважчими моральними виборами, які можуть змінити його назавжди.")
#db_manager.add_actor_to_film(2, 2)
#db_manager.add_actors(13, "крістіан.jpg", "Крістіан Бейл", "Кри́стиан Чарльз Фи́лип Бейл (англ. Christian Charles Philip Bale)", "30.01.1974", "Гаверфордвест, Пембрукшир, Уельс, Великобританія", "«Темний Лицар» (2008), «Престиж» (2006), «Темний лицар повертається» (2012), «Бетмен: Початок» (2005), «Аутсайдери» (2019)")
#db_manager.add_actor_to_film(3, 13)
#db_manager.add_actors(14, "хіт.jpg", "Гіт Леджер", "Гі́ткліфф Е́ндрю Ле́джер (англ. Heathcliff Andrew Ledger)", "04.04.1979, смерть: 22.01.2008", "Перт, Західна Австралія, Австралія", "«Темний Лицар» (2008), «Горбата гора» (2005), «10 причин моєї ненависті» (1999)")
#db_manager.add_actor_to_film(3, 14)
#db_manager.add_actors(15, "аарон.jpg", "Аарон Екгарт", "Аарон Едвард Екгарт (англ. Aaron Edward Eckhart )", "12.03.1968", "Купертіно, Каліфорнія, США", "«Темний Лицар» (2008), «Пантеон» (2022), «Темний лицар повертається» (2012)")
#db_manager.add_actor_to_film(3, 15)
#db_manager.add_actors(16, "майкл.jpg", "Майкл Кейн", "Моріс Джозеф Міклвайт (англ. Maurice Joseph Micklewhite)", "14.03.1933", "Ротерхайт, Лондон, Англія, Великобританія", "«Темний Лицар» (2008), «Початок» (2010), «Інтерстеллар» (2014), «Престиж» (2006), «Темний лицар повертається» (2012), «Бетмен: Початок» (2005)")
#db_manager.add_actor_to_film(3, 16)
#db_manager.add_actors(17, "меггі.jpg", "Меггі Джилленгол", "Маргаліт Рут Джілленхол (англ. Margalit  Ruth Gyllenhaal)", "16.11.1977", "Нижній Іст-Сайд, Нью-Йорк, Нью-Йорк, США", "«Темний Лицар» (2008), «Двійка» (2017), «Донні Дарко» (2001), «Адаптація» (2002)")
#db_manager.add_actor_to_film(3, 17)
#db_manager.add_actors(18, "гері.jpg", "Гарі Олдман", "Гері Леонард Олдмен (англ. Gary Leonard Oldman)", "21.03.1958", "Нью-Крос, Лондон, Англія, Великобританія", "«Темний Лицар» (2008), «Леон-кілер / Леон [Режисерська Версія]» (1994), «Темний лицар повертається» (2012), «Оппенгеймер» (2023), «Кульгаві коні» (2022), «Бетмен: Початок» (2005), «Гаррі Поттер та Смертельні Реліквії. Частина друга» (2011)")
#db_manager.add_actor_to_film(3, 18)



#db_manager.add_compositions(4, "хрещений батько 2.jpg", "Хрещений батько 2 (1974)", "Кримінал, драма", "Фільм" )
#db_manager.add_topic(44, 4, "хрещений батько 2.jpg", 1974, "США", "16+", "Драма, Кримінал", "Аль Пачіно, Роберт Дювалл, Даян Кітон, Роберт де Ніро, Джон Казал, Талія Шайр", "Френсіс Форд Коппола", "'Хрещений батько 2' – це епічна сага, яка продовжує історію відомої мафіозної сім'ї Корлеоне. На відміну від першої частини, де фокус був на Майклі Корлеоне, тут сюжет розгалужується на дві паралельні лінії:Молодість Віто Корлеоне: Фільм переносить нас у минуле, показуючи, як молодий Віто Корлеоне, після вбивства сім'ї на Сицилії, емігрує до Америки. Ми бачимо його становлення як успішного бізнесмена і, згодом, дона. Ця лінія допомагає глибше зрозуміти мотиви і цінності Віто, а також простежити, як він побудував свою імперію. Майкл Корлеоне в сьогоденні: Паралельно розвивається сюжет про Майкла, який тепер очолює сімейний бізнес. Він стикається з новими викликами, серед яких – розширення впливу сім'ї на захід, боротьба з політичними силами та конкуренція з іншими мафіозними кланами.")
#db_manager.add_actor_to_film(4, 8)
#db_manager.add_actor_to_film(4, 11)
#db_manager.add_actors(21, "роберт_де_ніро.jpg", "Роберт де Ніро", "Роберт Ентоні Де Ніро (англ. Robert Anthony De Niro)", "17.08.1943", "Нью-Йорк, США", "«Хрещений батько 2» (1974), «Таксист» (1976), «Скажений бик» (1980), «Ірландець» (2019)")
#db_manager.add_actor_to_film(4, 21)

#db_manager.add_actors(22, "даян_кітон.jpg", "Даян Кітон", "Даян Голл (англ. Diane Hall, псевдонім Даян Кітон)", "05.01.1946", "Лос-Анджелес, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Енні Холл» (1977)")
#db_manager.add_actor_to_film(4, 22)

#db_manager.add_actors(23, "джон_казал.jpg", "Джон Казал", "Джон Холланд Казал (англ. John Holland Cazale)", "12.08.1935, смерть: 12.03.1978", "Ревер, Массачусетс, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Мисливець на оленів» (1978)")
#db_manager.add_actor_to_film(4, 23)

#db_manager.add_actors(24, "талія_шайр.jpg", "Талія Шайр", "Талія Роуз Коппола (англ. Talia Rose Coppola)", "25.04.1946", "Лейк-Саксесс, Нью-Йорк, США", "«Хрещений батько» (1972), «Хрещений батько 2» (1974), «Роккі» (1976)")
#db_manager.add_actor_to_film(4, 24)


#db_manager.add_compositions(5, "12 розгніваних чоловіків.jpg", "12 розгніваних чоловіків (1957)", "Трилер, кримінал", "Фільм" )
#db_manager.add_topic(45, 5, "12 розгніваних чоловіків.jpg", 1957, "США", "16+", "Драма , Кримінал", "Мартін Балсам, Джон Фідлер, Лі Кобб, Джек Клаґмен, Едвард Біннс", "Сідні Люмет", "'12 Розгніваних Чоловіків' – це класична кінодрама, яка тримає глядача в напрузі від початку до кінця. Фільм розповідає історію дванадцяти присяжних, яким доручено вирішити долю молодого чоловіка, обвинуваченого у вбивстві власного батька.Сюжет розгортається в одній кімнаті, де присяжні змушені усамітнитися, щоб обговорити вердикт. На початку здається, що все просто: більшість присяжних схиляється до обвинувального вироку, адже всі докази вказують на винуватість підсудного. Однак, один присяжний висловлює сумнів. Саме він ініціює бурхливу дискусію, під час якої кожен з присяжних починає ставити під сумнів наявні докази та власні переконання.")
#db_manager.add_actors(61, "мартін_балсам.jpg", "Мартін Балсам", "Мартін Генрі Балсам (англ. Martin Henry Balsam)", "04.11.1919, смерть: 13.02.1996", "Бронкс, Нью-Йорк, США", "«12 розгніваних чоловіків» (1957), «Психо» (1960), «Всі люди президента» (1976)")
#db_manager.add_actor_to_film(5, 61)

#db_manager.add_actors(62, "джон_фідлер.jpg", "Джон Фідлер", "Джон Фідлер (англ. John Fiedler)", "03.02.1925, смерть: 25.06.2005", "Плімут, Міннесота, США", "«12 розгніваних чоловіків» (1957), «Вінні-Пух» (1966), «Щасливі дні» (1974–1984)")
#db_manager.add_actor_to_film(5, 62)

#db_manager.add_actors(63, "лі_кобб.jpg", "Лі Кобб", "Лі Джей Кобб (англ. Lee J. Cobb)", "08.12.1911, смерть: 11.02.1976", "Нью-Йорк, США", "«12 розгніваних чоловіків» (1957), «Вигнанець» (1973), «Вулиця гріха» (1945)")
#db_manager.add_actor_to_film(5, 63)

#db_manager.add_actors(64, "джек_клаґмен.jpg", "Джек Клаґмен", "Джек Клаґмен (англ. Jack Klugman)", "27.04.1922, смерть: 24.12.2012", "Філадельфія, США", "«12 розгніваних чоловіків» (1957), «Час зони сутінок» (1963), «Дивні пари» (1970–1975)")
#db_manager.add_actor_to_film(5, 64)

#db_manager.add_actors(65, "едвард_біннс.jpg", "Едвард Біннс", "Едвард Біннс (англ. Edward Binns)", "30.09.1916, смерть: 04.12.1990", "Філадельфія, США", "«12 розгніваних чоловіків» (1957), «Політ Фенікса» (1965), «Дванадцять годин до світанку» (1957)")
#db_manager.add_actor_to_film(5, 65)


#db_manager.add_actors(200, "вернер_герцог.jpg", "Вернер Герцог", "Вернер Герцог (нім. Werner Herzog)", "05.09.1942", "Мюнхен, Німеччина", "«Мандалорець» (2019), «Агуїрре, гнів Божий» (1972), «Носферату» (1979)")
#db_manager.add_actor_to_film(13, 200)

#db_manager.add_compositions(7, "Список Шиндлера.jpg", "Список Шиндлера (1993)", "Воєнний, драма", "Фільм" )
#db_manager.add_topic(47, 7, "Список Шиндлера.jpg", 1993, "США", "16+", "Фільм, Драма, Історичний, Біографічний", "Ліам Нісон, Бен Кінґслі, Ральф Файнс, Керолайн Ґудолл, Йонатан Сегаль, Ембет Девідц", "Стівен Спілберґ", "'Список Шиндлера' – це зворушлива кінодрама, заснована на реальних подіях, яка розповідає історію німецького бізнесмена Оскара Шиндлера, який врятував понад тисячу євреїв під час Голокосту. Дія розгортається в Кракові під час Другої світової війни. Оскар Шиндлер, член нацистської партії, приїздить до міста з метою сколотити капітал на війні. Спочатку він бачить у євреях лише дешеву робочу силу. Однак, зіткнувшись з жахами Голокосту, Шиндлер поступово змінюється. Він починає розуміти, що людське життя набагато цінніше за будь-які гроші. Шиндлер використовує свій вплив і зв'язки, щоб захистити євреїв, які працюють на його фабриці. Він підробляє документи, платить хабарі нацистським офіцерам і ризикує власним життям, щоб врятувати їх від депортації в концентраційні табори.")

# Гра престолів
db_manager.add_actors(201, "пітер_дінклейдж.jpg", "Пітер Дінклейдж", "Пітер Хенрі Дінклейдж (англ. Peter Dinklage)", "11.06.1969", "Джерсі Сіті, Нью-Джерсі, США", "«Гра престолів» (2011–2019), «Людина на місяці» (1999), «День незалежності» (1996)")
db_manager.add_actor_to_film(12, 201)

db_manager.add_actors(202, "ліна_гіді.jpg", "Ліна Гіді", "Ліна Гіді (англ. Lena Headey)", "03.10.1973", "Глазго, Шотландія, Велика Британія", "«Гра престолів» (2011–2019), «300 спартанців» (2006), «Дитина розуму» (2009)")
db_manager.add_actor_to_film(12, 202)

db_manager.add_actors(203, "кіт_герінґтон.jpg", "Кіт Герінґтон", "Крістофер Кіт Герінґтон (англ. Christopher Kit Harington)", "26.12.1986", "Лондон, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Північні Вітри» (2019), «День, коли Земля зупинилась» (2008)")
db_manager.add_actor_to_film(12, 203)

db_manager.add_actors(204, "емілія_кларк.jpg", "Емілія Кларк", "Емілія Ізабелла Кларк (англ. Emilia Isabelle Clarke)", "23.10.1986", "Лондон, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Термінатор: Генезис» (2015), «Гроза століття» (2019)")
db_manager.add_actor_to_film(12, 204)

db_manager.add_actors(205, "шон_бін.jpg", "Шон Бін", "Шон Марк Бін (англ. Sean Mark Bean)", "17.04.1959", "Шеффілд, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Володар перснів: Братство персня» (2001), «Сидіти в засідці» (2014)")
db_manager.add_actor_to_film(12, 205)

db_manager.add_actors(206, "джейсон_момоа.jpg", "Джейсон Момоа", "Джейсон Момоа (англ. Jason Momoa)", "01.08.1979", "Гонолулу, Гаваї, США", "«Гра престолів» (2011–2012), «Аквамен» (2018), «Багряний узбережжя» (2014)")
db_manager.add_actor_to_film(12, 206)

db_manager.add_actors(207, "мейсі_вільямс.jpg", "Мейсі Вільямс", "Мейсі Летісія Вільямс (англ. Maisie Williams)", "15.04.1997", "Брістоль, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Нова дівчина» (2019), «Вовк» (2016)")
db_manager.add_actor_to_film(12, 207)

db_manager.add_actors(208, "софі_тернер.jpg", "Софі Тернер", "Софі Белл Тернер (англ. Sophie Belinda Turner)", "21.02.1996", "Ньюкасл, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Люди Ікс: Апокаліпсис» (2016), «Віддана» (2017)")
db_manager.add_actor_to_film(12, 208)

db_manager.add_actors(209, "ісаак_хемпстед_райт.jpg", "Ісаак Хемпстед Райт", "Ісаак Хемпстед Райт (англ. Isaac Hempstead Wright)", "09.04.1999", "Хартфордшир, Англія, Велика Британія", "«Гра престолів» (2011–2019), «Вірна серце» (2018), «Сімейний портрет» (2017)")
db_manager.add_actor_to_film(12, 209)



#db_manager.add_compositions(8, "Кримінальне чтиво.jpg", "Кримінальне чтиво (1994)", "Кримінал, трилер", "Фільм" )
#db_manager.add_topic(1, 8, "Кримінальне чтиво.jpg", 1994, "США", "18+", "Драми , Кримінал , Трилери", "Тім Рот, Аманда Пламмер, Лаура Лавлейс, Джон Траволта, Філ ЛаМарр, Брюс Вілліс, Ума Турман, Семюел Л. Джексон", "Квентін Тарантіно", "'Кримінальне чтиво' (Pulp Fiction) — культовий фільм Квентіна Тарантіно, відомий своїм нелінійним сюжетом, що складається з трьох переплетених історій про кримінальний світ Лос-Анджелеса. 1. Вінсент і Джулс: Двоє найманців, Вінсент Веґа і Джулс Віннфілд, працюють на гангстера Марселласа Воллеса. Вони мають повернути валізу свого боса, яка була вкрадена, і прибирають 'свідків'. У процесі Джулс переживає 'диво' — випадок, який змушує його задуматися про своє життя та кримінальну кар'єру. 2. Вінсент і Міа: Марселлас доручає Вінсенту доглянути за його дружиною Мією Воллес, поки він у від'їзді. Вечір починається з вечері у ресторані та участі в танцювальному конкурсі, але закінчується драмою: Мія випадково приймає передозування героїну, який прийняла за кокаїн. Вінсент рятує їй життя, зробивши ін'єкцію адреналіну прямо в серце. 3. Бутч і золотий годинник: Боксер Бутч Кулідж отримує гроші від Марселласа, щоб 'здати' бій, але вирішує виграти і втекти з грошима. На втечі він згадує, що забув сімейну реліквію — золотий годинник. Повернувшись за ним, він потрапляє в жахливу ситуацію, де разом із Марселласом опиняється у полоні двох садистів. Їм вдається втекти, і Бутч залишає місто. 4. Кафе і фінал: Джулс і Вінсент опиняються у кафе, яке намагається пограбувати пара злочинців — Гарбуз і Зайченя. Джулс, під впливом свого 'прозріння', вирішує не вбивати їх і відпускає зі здобиччю, переглянувши свої принципи. Фільм завершується відкритим фіналом, і глядач залишається враженим стилем, діалогами, гумором і багатошаровістю персонажів." )


#db_manager.add_compositions(9, "Володар перснів_ Хранителі персня.jpg", "Володар перснів: Хранителі персня (2001)", "Фантастика, пригоди", "Фільм" )
#db_manager.add_topic(2, 9, "Володар перснів_ Хранителі персня.jpg", 2001, "Нова Зеландія, США", "12+", "Екшн , Пригоди , Драми , Фентезі", "Алан Говард, Ноел Епплбі, Шон Астін, Сала Бейкер, Шон Бін, Кейт Бланшетт, Елайджа Вуд, Ієн Маккеллен, Вігго Мортенсен", "Пітер Джексон", "У світі Середзем’я магічний Перстень Всевладдя, створений Темним Володарем Сауроном для підкорення світу, виявляється після тисячоліть забуття. Молодий гобіт Фродо Беґінс дізнається, що цей Перстень успадковано від його дядька Більбо. Перстень має неймовірну владу, але він також несе загрозу, бо спокушає навіть найсильніших своїм злом.Ґандальф Сірий, мудрий чарівник, пояснює Фродо, що Саурон прагне повернути Перстень, щоб відновити свою повну силу. Єдиний спосіб знищити Перстень — кинути його у вогонь гори Ородруїн у Мордорі, де його було викуто. Фродо разом із вірними друзями — гобітами Семом, Меррі та Піппіном — вирушає в небезпечну подорож. У Рівенделлі на ельфійській раді під проводом Елронда вирішують створити загін, який супроводжуватиме Фродо. Так формується Братство Персня, до якого входять: Фродо, як носій Персня, його вірний друг Семвайз Ґемджі (Сем), гобіти Меррі та Піппін, чарівник Ґандальф, ельф Леґолас, гном Ґімлі, люди Араґорн і Боромир. Під час подорожі вони стикаються з багатьма небезпеками: переслідуванням темних вершників-назґулів, битвами з орками та тролями, зрадою і внутрішніми випробуваннями. Братство проходить через Могільні гори, шахти Морії, де втрачають Ґандальфа, який бореться з демонічним Балроґом. Фінал фільму зосереджується на розпаді Братства. Боромир піддається спокусі Персня і намагається відібрати його у Фродо, але згодом гине, захищаючи Меррі та Піппіна від орків. Розуміючи, що він має виконати місію сам, Фродо вирішує йти в Мордор лише з Семом. Тим часом Меррі та Піппін потрапляють у полон, а Араґорн, Леґолас і Ґімлі вирушають їх рятувати.")


#db_manager.add_compositions(10, "Хороший, поганий, злий.jpg", "Хороший, поганий, злий (1966)", "Вестерн, екшн", "Фільм" )
#db_manager.add_topic(3, 10, "Хороший, поганий, злий.jpg", 1966, "Італія, Іспанія, Західна Німеччина, США", "16+", "Вестерн, екшн", "Елі Воллах, Клінт Іствуд, Лі Ван Кліф, Альдо Джуффре, Луїджі Пістіллі, Рада Рассімов", "Серджіо Леоне", "У фільмі 'Хороший, поганий, злий' троє шукачів скарбів — Хороший (Блондинчик), Поганий (Сентенза) та Злий (Туко) — змагаються за $200,000 у золотих монетах, захованих на кладовищі під час Громадянської війни в США.Кожен має частину інформації про місце скарбу, тому вони змушені співпрацювати, попри взаємну недовіру. У фіналі всі троє сходяться в напруженій дуелі на кладовищі, щоб вирішити, хто отримає золото. Блондинчик перемагає завдяки хитрості, залишає частину скарбу Туко, але знову переграє його, залишаючи прив’язаним у пустелі. Це історія про жадібність, хитрість і боротьбу за виживання в безжальному світі.")
# Додаємо акторів для фільму "Хороший, поганий, злий (1966)"

#db_manager.add_actors(110, "елі_воллах.jpg", "Елі Воллах", "Елі Гершел Воллах (англ. Eli Herschel Wallach)", "07.12.1915, смерть: 24.06.2014", "Бруклін, Нью-Йорк, США", "«Хороший, поганий, злий» (1966), «Чудова сімка» (1960), «Крестний батько: Частина III» (1990)")
#db_manager.add_actor_to_film(10, 110)

#db_manager.add_actors(111, "клінт_іствуд.jpg", "Клінт Іствуд", "Клінтон Іствуд-молодший (англ. Clinton Eastwood Jr.)", "31.05.1930", "Сан-Франциско, Каліфорнія, США", "«Хороший, поганий, злий» (1966), «Грані торкань» (1971), «Непрощений» (1992), «Гран Торіно» (2008)")
#db_manager.add_actor_to_film(10, 111)

#db_manager.add_actors(112, "лі_ван_кліф.jpg", "Лі Ван Кліф", "Кларенс Лерой Ван Кліф (англ. Clarence Leroy Van Cleef Jr.)", "09.01.1925, смерть: 16.12.1989", "Сомервілл, Нью-Джерсі, США", "«Хороший, поганий, злий» (1966), «За жменю доларів» (1965), «Втеча з Нью-Йорка» (1981)")
#db_manager.add_actor_to_film(10, 112)

#db_manager.add_actors(113, "альдо_джуффре.jpg", "Альдо Джуффре", "Альдо Джуффре (італ. Aldo Giuffrè)", "10.04.1924, смерть: 26.06.2010", "Неаполь, Італія", "«Хороший, поганий, злий» (1966), «Тото у космосі» (1958), «Чорні втікачі» (1968)")
#db_manager.add_actor_to_film(10, 113)

#db_manager.add_actors(114, "луїджі_пістіллі.jpg", "Луїджі Пістіллі", "Луїджі Пістіллі (італ. Luigi Pistilli)", "19.07.1929, смерть: 21.04.1996", "Ґроссето, Італія", "«Хороший, поганий, злий» (1966), «Гра» (1973), «Вбивство в коледжі» (1974)")
#db_manager.add_actor_to_film(10, 114)

#db_manager.add_actors(115, "рада_рассімов.jpg", "Рада Рассімов", "Рада Рассімов (італ. Rada Rassimov)", "07.03.1938", "Трієст, Італія", "«Хороший, поганий, злий» (1966), «Слово про героя» (1972), «Ціна помсти» (1970)")
#db_manager.add_actor_to_film(10, 115)



# Список Шиндлера (1993)
#db_manager.add_actors(78, "ліам_нісон.jpg", "Ліам Нісон", "Вільям Джон Нісон (англ. William John Neeson)", "07.06.1952", "Північна Ірландія", "«Список Шиндлера» (1993), «Заручниця» (2008), «Гангстер №1» (2002)")
#db_manager.add_actor_to_film(7, 78)

#db_manager.add_actors(79, "бен_кінґслі.jpg", "Бен Кінґслі", "Крішна Пандіт Бганджі (англ. Krishna Pandit Bhanji)", "31.12.1943", "Великобританія", "«Список Шиндлера» (1993), «Ганді» (1982), «Шатлсворт» (2004)")
#db_manager.add_actor_to_film(7, 79)

#db_manager.add_actors(80, "ральф_файнс.jpg", "Ральф Файнс", "Рейф Натанієль Твіслтон-Вайкгем-Файнз (англ. Ralph Nathaniel Twisleton-Wykeham-Fiennes)", "22.12.1962", "Англія", "«Список Шиндлера» (1993), «Готель Гранд Будапешт» (2014), «Гаррі Поттер» (2005–2011)")
#db_manager.add_actor_to_film(7, 80)

#db_manager.add_actors(81, "керолайн_ґудолл.jpg", "Керолайн Ґудолл", "Керолайн Крус Гудолл (англ. Caroline Cruice Goodall)", "13.11.1959", "Англія", "«Список Шиндлера» (1993), «Хук» (1991), «Білий Слон» (2013)")
#db_manager.add_actor_to_film(7, 81)

#db_manager.add_actors(82, "йонатан_сегаль.jpg", "Йонатан Сегаль", "Джонатан Сегал (англ. Jonathan Sagall)", "23.04.1959", "Ізраїль", "«Список Шиндлера» (1993)")
#db_manager.add_actor_to_film(7, 82)

#db_manager.add_actors(83, "ембет_девідц.jpg", "Ембет Девідц", "Ембет Джин Девідц (англ. Embeth Jean Davidtz)", "11.08.1965", "США", "«Список Шиндлера» (1993), «Армія темряви» (1992), «Тисяча акрів» (1997)")
#db_manager.add_actor_to_film(7, 83)


# Кримінальне чтиво (1994)
#db_manager.add_actors(84, "тім_рот.jpg", "Тім Рот", "Тімоті Саймон Рот (англ. Timothy Simon Roth)", "14.05.1961", "Англія", "«Кримінальне чтиво» (1994), «Скажені пси» (1992), «Халк» (2008)")
#db_manager.add_actor_to_film(8, 84)

#db_manager.add_actors(85, "аманда_пламмер.jpg", "Аманда Пламмер", "Аманда Майкл Пламмер (англ. Amanda Michael Plummer)", "23.03.1957", "США", "«Кримінальне чтиво» (1994), «Мертва брехня» (1997), «Король-рибалка» (1991)")
#db_manager.add_actor_to_film(8, 85)

#db_manager.add_actors(86, "лаура_лавлейс.jpg", "Лаура Лавлейс", "Лаура Лавлейс (англ. Laura Lovelace)", "Невідомо", "США", "«Кримінальне чтиво» (1994)")
#db_manager.add_actor_to_film(8, 86)

#db_manager.add_actors(87, "джон_траволта.jpg", "Джон Траволта", "Джон Джо́зеф Траво́лта (англ. John Joseph Travolta)", "18.02.1954", "США", "«Кримінальне чтиво» (1994), «Лихоманка суботнього вечора» (1977), «Обличчям до обличчя» (1997)")
#db_manager.add_actor_to_film(8, 87)

#db_manager.add_actors(88, "філ_ламарр.jpg", "Філ ЛаМарр", "Філіп Ламарр (англ. Phillip LaMarr)", "24.01.1967", "США", "«Кримінальне чтиво» (1994), «Мадагаскар» (2005), «Самурай Джек» (2001–2017)")
#db_manager.add_actor_to_film(8, 88)

#db_manager.add_actors(89, "брюс_вілліс.jpg", "Брюс Вілліс", "Во́лтер Брюс Ві́лліс (англ. Walter Bruce Willis)", "19.03.1955", "США", "«Кримінальне чтиво» (1994), «Міцний горішок» (1988), «Шосте чуття» (1999)")
#db_manager.add_actor_to_film(8, 89)

#db_manager.add_actors(90, "ума_турман.jpg", "Ума Турман", "Ума Каруна Турман (англ. Uma Karuna Thurman)", "29.04.1970", "США", "«Кримінальне чтиво» (1994), «Убити Білла» (2003–2004), «Генрі і Джун» (1990)")
#db_manager.add_actor_to_film(8, 90)

#db_manager.add_actors(91, "семюел_л_джексон.jpg", "Семюел Л. Джексон", "Се́мюел Лірой Дже́ксон (англ. Samuel Leroy Jackson)", "21.12.1948", "США", "«Кримінальне чтиво» (1994), «Месники» (2012), «Джанґо вільний» (2012)")
#db_manager.add_actor_to_film(8, 91)


# Володар перснів: Хранителі персня (2001)
#db_manager.add_actors(92, "алан_говард.jpg", "Алан Ховард", "Алан Ховард (англ. Alan Howard)", "05.08.1937, смерть: 14.02.2015", "Великобританія", "«Володар перснів: Хранителі персня» (2001), «Амадей» (1984)")
#db_manager.add_actor_to_film(9, 70)
#db_manager.add_actor_to_film(9, 92)
#db_manager.add_actor_to_film(9, 72)
#db_manager.add_actor_to_film(9, 76)
#db_manager.add_actor_to_film(9, 77)
#db_manager.add_actor_to_film(9, 75)

#db_manager.add_actors(100, "ліворд_тайлер.jpg", "Лів Тайлер", "Лів Рундґрен (англ. Liv Rundgren Tyler)", "01.07.1977", "США", "«Володар перснів» (2001–2003), «Армагеддон» (1998), «Тиха сім'я» (1994)")
#db_manager.add_actor_to_film(9, 100)

#db_manager.add_actors(101, "орландо_блум.jpg", "Орландо Блум", "Орландо Джонатан Бланчард Блум (англ. Orlando Jonathan Blanchard Bloom)", "13.01.1977", "Великобританія", "«Володар перснів» (2001–2003), «Пірати Карибського моря» (2003–2017), «Царство небесне» (2005)")
#db_manager.add_actor_to_film(9, 101)


# Хороший, поганий, злий (1966)

#Серіали

#db_manager.add_compositions(11, "пуститися берега.jpg", "Пуститися берега (2008)", "Драма, Трилер", "Серіал")
#db_manager.add_topic(4, 11, "пуститися берега.jpg", 2008, "США", "18+", "Драма, Трилери, Серіал", "Мішель МакЛарен, Адам Бернштейн, Вінс Ґіліґан, Браян Кренстон, Анна Ґанн, Аарон Пол", "Вінс Ґіліґан", "Сюжет починається з історії Волтера Вайта, скромного вчителя хімії в Альбукерке, штат Нью-Мексико. Дізнавшись, що у нього рак легенів, і розуміючи, що його сім’я опиниться у скрутному фінансовому становищі після його смерті, Волтер вирішує заробити грошей на виробництві та продажу метамфетаміну.Для цього він об’єднується зі своїм колишнім учнем Джессі Пінкманом, який має зв’язки в кримінальному світі. Разом вони починають нелегальний бізнес, але з часом стикаються з небезпекою наркоторгівлі, конфліктами з мафією, а також моральними та етичними дилемами. Волтер поступово змінюється: від турботливого батька та чоловіка до безжального злочинця, відомого під псевдонімом 'Гайзенберг'. Його амбіції, жорстокість і хитрість перетворюють його життя, але водночас руйнують стосунки з близькими.")
#db_manager.add_actors(160, "браян_кренстон.jpg", "Браян Кренстон", "Браян Лі Кренстон (англ. Bryan Lee Cranston)", "07.03.1956", "Голлівуд, Каліфорнія, США", "«Пуститися берега» (2008–2013), «Малькольм у центрі уваги» (2000–2006), «Арго» (2012)")
#db_manager.add_actor_to_film(11, 160)

#

#db_manager.add_compositions(12, "гра престолів.jpg", "Гра Престолів (2011)", "Драма, Пригоди, Фантастика", "Серіал" )
#db_manager.add_topic(12, 12, "гра престолів.jpg", 2011, "США", "18+", "Драма, Пригоди, Фантастика", "Пітер Дінклейдж, Ліна Гіді, Кіт Герінґтон, Емілія Кларк, Шон Бін, Джейсон Момоа, Мейсі Вільямс, Софі Тернер, Ісаак Хемпстед Райт", "Тім Ван Паттен, Браян Кірк, Деніел Мінахан, Алан Тейлор", "Дія серіалу розгортається на континентах Вестерос і Ессос, де кілька аристократичних родів борються за Залізний трон – символ верховної влади. Головними родами є Старки, Ланністери, Баратеони, Таргарієни та інші. Кожен із них має власні амбіції, інтриги й секрети.Паралельно з політичною боротьбою у Вестеросі зростає загроза за Стіною – північним кордоном, який захищає королівства від магічних істот, званих Іншими (білими ходоками). Водночас у вигнанні на сході Дейенеріс Таргарієн, остання представниця колись могутньої династії, прагне повернути собі трон, використовуючи силу своїх драконів.")



#db_manager.add_compositions(13, "Мандалорець.jpg", "Мандалорець / Мандалоріанець (2019)", "Пригоди, Фантастика", "Серіал" )
#db_manager.add_topic(48, 13, "Мандалорець.jpg", 2019, "США", "12+", "Пригоди, Фантастика","Педро Паскаль, Карл Везерс, Джина Карано, Вернер Герцог, Джанкарло Еспозіто", "Джон Фавро","'Мандалорець' – це частина всесвіту 'Зоряних воєн', яка слідує за пригодами самотнього мисливця за головами в галактиці, де панує беззаконня після падіння Імперії.")
#






##


#db_manager.add_compositions(15, "Клан Сопрано.jpg", "Клан Сопрано (1999)", "Драма, Кримінал", "Серіал")
#db_manager.add_compositions(16, "Сайнфелд.jpg", "Сайнфелд (1989)", "Комеді", "Серіал")
#db_manager.add_compositions(17, "Картковий будинок.jpg", "Картковий будинок (2013)", "Драма", "Серіал")
#db_manager.add_compositions(18, "загубленні.jpg", "Загублені (2004)", "Детектив, Драма, Пригоди, Трилер, Фантастика", "Серіал")
#db_manager.add_compositions(19, "Світ Дикого Заходу.jpg", "Світ Дикого Заходу (2016)", "Детектив, Драма, Пригоди, Фантастика", "Серіал")
#db_manager.add_compositions(20, "Дивні Дива.jpg", "Дивні Дива (2016)", "Детектив, Драма, Жахи, Трилер, Фантастика", "Серіал")



#Мультфільми

#db_manager.add_compositions(21, "віднесені привидами.jpg", "Віднесені привидами (2001)", "Фантастика, Пригоди", "Мультфільм")
#db_manager.add_topic(200, 21, "віднесені привидами.jpg", 2001, "Японія", "12+", "Фантастика, Пригоди", "Румі Хіраґі, Мію Іріно, Марі Нацукі, Тацуя Гашіха", "Хаяо Міядзакі", "'Віднесені привидами' – це історія десятирічної Тіхіро, яка разом із батьками потрапляє у загадковий світ духів. Її батьків перетворюють на свиней, і тепер дівчинка має працювати в магічній лазні відьми Юбаби, щоб знайти шлях додому, розкрити свої сили та звільнити родину.")

#db_manager.add_compositions(22, "Kimetsu no Yaiba Tsuzumi Yashiki-hen.jpg", "Kimetsu no Yaiba: Tsuzumi Yashiki-hen (2021)", "Аніме, Бойовик, Фентезі", "Мультфільм")
#db_manager.add_topic(199, 22, "Kimetsu no Yaiba Tsuzumi Yashiki-hen.jpg", 2021, "Японія", "16+", "Аніме, Бойовик, Фентезі", "Нацукі Ханае, Акари Кіто, Хіро Шімоно, Юкі Каджі", "Харуо Сотодзакі", "'Kimetsu no Yaiba: Tsuzumi Yashiki-hen' – це частина саги про мисливців на демонів. Танджиро та його друзі стикаються з новим небезпечним демоном у зачарованому особняку. Битва наповнена драматизмом, неймовірними візуальними ефектами та глибокими емоційними моментами, що показують силу духу головного героя.")

#db_manager.add_compositions(23, "король лев.jpg", "Король Лев (1994)", "Дитячий, Мюзикл", "Мультфільм")
##db_manager.add_compositions(24, "людина павук крізь всесвіт.jpg", "Людина-павук: Крізь Всесвіт (2023)", "Екшн, Наукова фантастика", "Мультфільм")
#db_manager.add_compositions(25, "могила світлячків.jpg", "Могила світлячків (1988)", "Воєнний, Драма", "Мультфільм")
#db_manager.add_compositions(26, "Людина павук Навколо світу.jpg", "Людина павук: Навколо світу (2018)", "Пригоди, Екшн", "Мультфільм")
#db_manager.add_compositions(27, "Твоє ім’я.jpg", "Твоє ім’я (2016)", "Фантастика, Романтика", "Мультфільм")
#db_manager.add_compositions(28, "коко.jpg", "Коко (2017)", "Дитячий, Фантастика", "Мультфільм")
#db_manager.add_compositions(29, "ВОЛЛ-І.jpg", "ВОЛЛ-І (2008)", "Дитячий, Наукова фантастика", "Мультфільм")
#db_manager.add_compositions(30, "історія іграшок.jpg", "Історія іграшок (1995)", " Дитячий, Комедія", "Мультфільм")

#Мультсеріали
#

#db_manager.add_compositions(31, "Аватар Останній захисник.jpg", "Аватар: Останній захисник (2005 — 2008)", "Екшн", "Мультсеріал")


#db_manager.add_compositions(32, "Рік та Морті.jpg", "Рік та Морті (2013 — ...)", "Комедія, Фантастика, Пригода", "Мультсеріал")
#db_manager.add_compositions(33, "Аркейн.jpg", "Аркейн (2021 — 2024)", "Драма", "Мультсеріал")
#db_manager.add_compositions(34, "Бетмен Мультсеріал.jpg", "Бетмен: Мультсеріал (1992 — 1995)", "Екшн", "Мультсеріал")
#db_manager.add_compositions(35, "Таємниці Ґравіті Фолз.jpg", "Таємниці Ґравіті Фолз (2012 — 2016)", "Містерія", "Мультсеріал")
#db_manager.add_compositions(36, "Коняка БоДжек.jpg", "Коняка БоДжек (2014 — 2020)", "Ситком", "Мультсеріал")
#db_manager.add_compositions(37, "Сімпсони.jpg", "Сімпсони (1989 — ...)", "Ситком", "Мультсеріал")
#db_manager.add_compositions(38, "Південний Парк.jpg", "Південний Парк (1997 — ...)", "Комедія", "Мультсеріал")
#db_manager.add_compositions(39, "Блакитноокий самурай.jpg", "Блакитноокий самурай (2023 — ...)", "Екшн", "Мультсеріал")
#db_manager.add_compositions(40, "За Садовим Парканом.jpg", "За Садовим Парканом (2014)", "Пригода", "Мультсеріал")




